PKS1C/src/Documents/СменаДатКлючевыхНосителей/СменаДатКлючевыхНосителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменаДатКлючевыхНосителей</name>
  <registerRecords>InformationRegister.ДатыКлючевыеНосители</registerRecords>
  <attributes>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </attributes>
  <attributes>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/InformationRegisters/ДатыКлючевыеНосители/ДатыКлючевыеНосители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыКлючевыеНосители</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Documents/СменаДатКлючевыхНосителей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДатыКлючевыеНосители
	Движения.ДатыКлючевыеНосители.Записывать = Истина;
	Движение = Движения.ДатыКлючевыеНосители.Добавить();
	Движение.Период = Дата;
	Движение.КлючевойНоситель = КлючевойНоситель;
	Движение.RSAС = RSAС;
	Движение.RSAДо = RSAДо;
	Движение.ГОСТС = ГОСТС;
	Движение.ГОСТДо = ГОСТДо;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
